
# config/juglist.py


# =========================================================
# 対象機種
# =========================================================

JUG_MACHINE_NAMES = [
    "SミスタージャグラーKK",
    "ミスタージャグラー",
    "S ミスタージャグラー KK",
    "ﾐｽﾀｰｼﾞｬｸﾞﾗｰ",
    "SﾐｽﾀｰｼﾞｬｸﾞﾗｰKK",

    "SジャグラーガールズSS-KH",
    "ジャグラーガールズSS",
    "SｼﾞｬｸﾞﾗｰｶﾞｰﾙｽﾞSS-KH",
    "S ジャグラーガールズSS KH",
    "ｼﾞｬｸﾞﾗｰｶﾞｰﾙｽﾞSS",
    "SｼﾞｬｸﾞﾗｰｶﾞｰﾙｽﾞSS",
    "⑥SｼﾞｬｸﾞﾗｰｶﾞｰﾙｽﾞSS",

    "⑥Sｳﾙﾄﾗﾐﾗｸﾙｼﾞｬｸﾞﾗｰ",

    "Sゴーゴージャグラー3KA",
    "ゴーゴージャグラー3",
    "Sゴーゴージャグラー3KA",
    "S ゴーゴージャグラー3 KA",
    "ｺﾞｰｺﾞｰｼﾞｬｸﾞﾗｰ3",
    "⑥Sｺﾞｰｺﾞｰｼﾞｬｸﾞﾗｰ3",
    "Sｺﾞｰｺﾞｰｼﾞｬｸﾞﾗｰ3KA",

    "SハッピージャグラーVⅢEA",
    "ハッピージャグラーVⅢ",
    "SハッピージャグラーVⅢEA",
    "S ハッピージャグラーV Ⅲ EA",
    "SハッピージャグラーV III EA",
    "ﾊｯﾋﾟｰｼﾞｬｸﾞﾗｰVIII",
    "⑥SﾊｯﾋﾟｰｼﾞｬｸﾞﾗｰVIII",
    "SﾊｯﾋﾟｰｼﾞｬｸﾞﾗｰV III EA",

    "SネオアイムジャグラーEX-KK",
    "ネオアイムジャグラーEX",
    "ﾈｵｱｲﾑｼﾞｬｸﾞﾗｰEX",
    "S ネオアイムジャグラーEX KK",
    "SﾈｵｱｲﾑｼﾞｬｸﾞﾗｰEX",
    "SﾈｵｱｲﾑｼﾞｬｸﾞﾗｰEX-KK",
    "⑥SﾈｵｱｲﾑｼﾞｬｸﾞﾗｰEX",

    "SアイムジャグラーEX-TP",
    "アイムジャグラーEX",
    "SアイムジャグラーEX　TP",
    "SｱｲﾑｼﾞｬｸﾞﾗｰEX",
    "SｱｲﾑｼﾞｬｸﾞﾗｰEX-TP",
    "ｱｲﾑｼﾞｬｸﾞﾗｰEX-TP",
    "アイムジャグラーEX　TP",
    "S ｱｲﾑｼﾞｬｸﾞﾗーEX－TP",
    "⑥SｱｲﾑｼﾞｬｸﾞﾗｰEX",

    "SマイジャグラーVKD",
    "マイジャグラーⅤ",
    "SマイジャグラーⅤKD",
    "S マイジャグラーⅤ KD",
    "ﾏｲｼﾞｬｸﾞﾗｰV",
    "ﾏｲｼﾞｬｸﾞﾗｰⅤKD",
    "⑥SﾏｲｼﾞｬｸﾞﾗｰV",
    "SﾏｲｼﾞｬｸﾞﾗｰVKD",

    
    "SｳﾙﾄﾗﾐﾗｸﾙｼﾞｬｸﾞﾗｰKT",
    "SウルトラミラクルジャグラーKT",
    "ウルトラミラクルジャグラー",
    "SウルトラミラクルジャグラーKT",
    "ｳﾙﾄﾗﾐﾗｸﾙｼﾞｬｸﾞﾗｰ",
    "⑥Sｳﾙﾄﾗﾐﾗｸﾙｼﾞｬｸﾞﾗｰ",

    "Sファンキージャグラー2KT",
    "ファンキージャグラー2",
    "Sファンキージャグラー2KT",
    "S ファンキージャグラー2 KT",
    "ﾌｧﾝｷｰｼﾞｬｸﾞﾗｰ2KT",
    "⑥Sﾌｧﾝｷｰｼﾞｬｸﾞﾗｰ2KT",

    "SマイジャグラーⅥKD",
    "マイジャグラーⅥ",
    "SマイジャグラーⅥKD",
    "S マイジャグラーⅥ KD",
    "ﾏｲｼﾞｬｸﾞﾗｰⅥ",
    "ﾏｲｼﾞｬｸﾞﾗｰⅥKD",
    "⑥SﾏｲｼﾞｬｸﾞﾗｰⅥ",
]


# =========================================================
# DB側の機種名カラム
# =========================================================

MACHINE_NAME_COLUMN = "機種名"


# =========================================================
# CSVへ出力するカラム
# =========================================================

#実際日=実行日-1日処理済みで以下には実際日はいれない

EXPORT_COLUMNS = [
    "実行日",
    "台番号",
    "機種名",
    "BONUS",
    "BIG",
    "REG",
    "累計ゲーム",
    "出枚数",
    "svg差枚",
]


# =========================================================
# CSVファイル名
# =========================================================

EXPORT_FILE_NAME = "jug.csv"

